import { simpleButtonTransitionClass } from "@/app/utils/hover_animation";
import { Button } from "@nextui-org/react"
import { MdOutlineAddIcCall } from "react-icons/md";

export default function AboutPage(){
    return (
        <div className="mx-10 my-4">
            <div className={`grid grid-cols-2 px-6 pt-40 h-[97vh] rounded-lg bg-[#EBEEED] bg-[url('/grid.png')]`}>
                <div className="rounded-lg bg-orange-300 bg-[url('/bglast.png')] mb-10 mx-10 border-2 shadow-2xl transition duration-300 ease-in-out hover:scale-90" />
                <div className="flex flex-col  mt-10">
                    <h1 className="text-5xl font-bold mb-10">در مورد تیم ما</h1>
                    <h1>{des}</h1>
                    <Button className={`mt-5 w-72 py-5 rounded-lg bg-primary text-black ${simpleButtonTransitionClass} hover:scale-110 hover:shadow-xl`}>
                        <MdOutlineAddIcCall />
                        تماس با ما  
                    </Button>

                </div>
            </div>
        </div>
    )
}

const des = "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."